GopalSaraf/Practicals/PSDL/include/proc/pic16f17125.inc
#define ORS1                             BANKMASK(OPA1ORS), 1
#define ORS2                             BANKMASK(OPA1ORS), 2
#define ORS3                             BANKMASK(OPA1ORS), 3
#define ORS4                             BANKMASK(OPA1ORS), 4
#define OSFIE                            BANKMASK(PIE1), 5
#define OSFIF                            BANKMASK(PIR1), 5
#define OUT0                             BANKMASK(CRCOUTL), 0
#define OUT1                             BANKMASK(CRCOUTL), 1
#define OUT10                            BANKMASK(CRCOUTH), 2
#define OUT11                            BANKMASK(CRCOUTH), 3
#define OUT12                            BANKMASK(CRCOUTH), 4
#define OUT13                            BANKMASK(CRCOUTH), 5
#define OUT14                            BANKMASK(CRCOUTH), 6
#define OUT15                            BANKMASK(CRCOUTH), 7
#define OUT16                            BANKMASK(CRCOUTU), 0
#define OUT17                            BANKMASK(CRCOUTU), 1
#define OUT18                            BANKMASK(CRCOUTU), 2
#define OUT19                            BANKMASK(CRCOUTU), 3
#define OUT2                             BANKMASK(CRCOUTL), 2
#define OUT20                            BANKMASK(CRCOUTU), 4
#define OUT21                            BANKMASK(CRCOUTU), 5
#define OUT22                            BANKMASK(CRCOUTU), 6
#define OUT23                            BANKMASK(CRCOUTU), 7
#define OUT24                            BANKMASK(CRCOUTT), 0
#define OUT25                            BANKMASK(CRCOUTT), 1
#define OUT26                            BANKMASK(CRCOUTT), 2
#define OUT27                            BANKMASK(CRCOUTT), 3
#define OUT28                            BANKMASK(CRCOUTT), 4
#define OUT29                            BANKMASK(CRCOUTT), 5
#define OUT3                             BANKMASK(CRCOUTL), 3
#define OUT30                            BANKMASK(CRCOUTT), 6
#define OUT31                            BANKMASK(CRCOUTT), 7
#define OUT4                             BANKMASK(CRCOUTL), 4
#define OUT5                             BANKMASK(CRCOUTL), 5
#define OUT6                             BANKMASK(CRCOUTL), 6
#define OUT7                             BANKMASK(CRCOUTL), 7
#define OUT8                             BANKMASK(CRCOUTH), 0
#define OUT9                             BANKMASK(CRCOUTH), 1
#define OVRA                             BANKMASK(CWG1STR), 4
#define OVRB                             BANKMASK(CWG1STR), 5
#define OVRC                             BANKMASK(CWG1STR), 6
#define OVRD                             BANKMASK(CWG1STR), 7
#define P1M1                             BANKMASK(CCP1CON), 7
#define P2M1                             BANKMASK(CCP2CON), 7
#define PCH3                             BANKMASK(ADPCH), 3
#define PCH4                             BANKMASK(ADPCH), 4
#define PCH5                             BANKMASK(ADPCH), 5
#define PCSC                             BANKMASK(ADCON1), 1
#define PEIE                             BANKMASK(INTCON), 6
#define PEN1                             BANKMASK(SSP1CON2), 2
#define PEN2                             BANKMASK(SSP2CON2), 2
#define PFM                              BANKMASK(NCO1CON), 0
#define PLEN0                            BANKMASK(CRCCON1), 0
#define PLEN1                            BANKMASK(CRCCON1), 1
#define PLEN2                            BANKMASK(CRCCON1), 2
#define PLEN3                            BANKMASK(CRCCON1), 3
#define PLEN4                            BANKMASK(CRCCON1), 4
#define PLLEN                            BANKMASK(OSCEN), 0
#define PLLR                             BANKMASK(OSCSTAT), 0
#define POLA                             BANKMASK(CWG1CON1), 0
#define POLB                             BANKMASK(CWG1CON1), 1
#define POLC                             BANKMASK(CWG1CON1), 2
#define POLD                             BANKMASK(CWG1CON1), 3
#define PPOL                             BANKMASK(ADCON1), 7
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PRE0                             BANKMASK(ADPREL), 0
#define PRE1                             BANKMASK(ADPREL), 1
#define PRE10                            BANKMASK(ADPREH), 2
#define PRE11                            BANKMASK(ADPREH), 3
#define PRE12                            BANKMASK(ADPREH), 4
#define PRE2                             BANKMASK(ADPREL), 2
#define PRE3                             BANKMASK(ADPREL), 3
#define PRE4                             BANKMASK(ADPREL), 4
#define PRE5                             BANKMASK(ADPREL), 5
#define PRE6                             BANKMASK(ADPREL), 6
#define PRE7                             BANKMASK(ADPREL), 7
#define PRE8                             BANKMASK(ADPREH), 0
#define PRE9                             BANKMASK(ADPREH), 1
#define PREF0                            BANKMASK(ADREF), 0
#define PREF1                            BANKMASK(ADREF), 1
#define PREV0                            BANKMASK(ADPREVL), 0
#define PREV1                            BANKMASK(ADPREVL), 1
#define PREV10                           BANKMASK(ADPREVH), 2
#define PREV11                           BANKMASK(ADPREVH), 3
#define PREV12                           BANKMASK(ADPREVH), 4
#define PREV13                           BANKMASK(ADPREVH), 5
#define PREV14                           BANKMASK(ADPREVH), 6
#define PREV15                           BANKMASK(ADPREVH), 7
#define PREV2                            BANKMASK(ADPREVL), 2
#define PREV3                            BANKMASK(ADPREVL), 3
#define PREV4                            BANKMASK(ADPREVL), 4
#define PREV5                            BANKMASK(ADPREVL), 5
#define PREV6                            BANKMASK(ADPREVL), 6
#define PREV7                            BANKMASK(ADPREVL), 7
#define PREV8                            BANKMASK(ADPREVH), 0
#define PREV9                            BANKMASK(ADPREVH), 1
#define PS0                              BANKMASK(WDTCON0), 1
#define PS1                              BANKMASK(WDTCON0), 2
#define PS2                              BANKMASK(WDTCON0), 3
#define PS3                              BANKMASK(WDTCON0), 4
#define PS4                              BANKMASK(WDTCON0), 5
#define PSCNT0                           BANKMASK(WDTPSL), 0
#define PSCNT1                           BANKMASK(WDTPSL), 1
#define PSCNT10                          BANKMASK(WDTPSH), 2
#define PSCNT11                          BANKMASK(WDTPSH), 3
#define PSCNT12                          BANKMASK(WDTPSH), 4
#define PSCNT13                          BANKMASK(WDTPSH), 5
#define PSCNT14                          BANKMASK(WDTPSH), 6
#define PSCNT15                          BANKMASK(WDTPSH), 7
#define PSCNT16                          BANKMASK(WDTTMR), 0
#define PSCNT17                          BANKMASK(WDTTMR), 1
#define PSCNT2                           BANKMASK(WDTPSL), 2
#define PSCNT3                           BANKMASK(WDTPSL), 3
#define PSCNT4                           BANKMASK(WDTPSL), 4
#define PSCNT5                           BANKMASK(WDTPSL), 5
#define PSCNT6                           BANKMASK(WDTPSL), 6
#define PSCNT7                           BANKMASK(WDTPSL), 7
#define PSCNT8                           BANKMASK(WDTPSH), 0
#define PSCNT9                           BANKMASK(WDTPSH), 1
#define PSIS                             BANKMASK(ADCON2), 7
#define PWM1IE                           BANKMASK(PIE3), 1
#define PWM1IF                           BANKMASK(PIR3), 1
#define PWM1MD                           BANKMASK(PMD1), 7
#define PWM1PIE                          BANKMASK(PIE3), 0
#define PWM1PIF                          BANKMASK(PIR3), 0
#define PWM2IE                           BANKMASK(PIE3), 3
#define PWM2IF                           BANKMASK(PIR3), 3
#define PWM2MD                           BANKMASK(PMD2), 0
#define PWM2PIE                          BANKMASK(PIE3), 2
#define PWM2PIF                          BANKMASK(PIR3), 2
#define PWS0                             BANKMASK(NCO1CLK), 5
#define PWS1                             BANKMASK(NCO1CLK), 6
#define PWS2                             BANKMASK(NCO1CLK), 7
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC1IE                            BANKMASK(PIE4), 7
#define RC1IF                            BANKMASK(PIR4), 7
#define RC2                              BANKMASK(PORTC), 2
#define RC2IE                            BANKMASK(PIE5), 1
#define RC2IF                            BANKMASK(PIR5), 1
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RCEN2                            BANKMASK(SSP2CON2), 3
#define RD                               BANKMASK(NVMCON1), 0
#define RD161                            BANKMASK(T1CON), 1
#define RD163                            BANKMASK(T3CON), 1
#define RDY                              BANKMASK(FVRCON), 6
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2
#define REFRNG                           BANKMASK(DAC1CON), 6
#define REN                              BANKMASK(CWG1AS0), 6
#define RES0                             BANKMASK(ADRESL), 0
#define RES1                             BANKMASK(ADRESL), 1
#define RES10                            BANKMASK(ADRESH), 2
#define RES11                            BANKMASK(ADRESH), 3
#define RES12                            BANKMASK(ADRESH), 4
#define RES13                            BANKMASK(ADRESH), 5
#define RES14                            BANKMASK(ADRESH), 6
#define RES15                            BANKMASK(ADRESH), 7
#define RES2                             BANKMASK(ADRESL), 2
#define RES3                             BANKMASK(ADRESL), 3
#define RES4                             BANKMASK(ADRESL), 4
#define RES5                             BANKMASK(ADRESL), 5
#define RES6                             BANKMASK(ADRESL), 6
#define RES7                             BANKMASK(ADRESL), 7
#define RES8                             BANKMASK(ADRESH), 0
#define RES9                             BANKMASK(ADRESH), 1
#define RESON                            BANKMASK(OPA1CON1), 3
#define ROI                              BANKMASK(CPUDOZE), 5
#define RPT0                             BANKMASK(ADRPT), 0
#define RPT1                             BANKMASK(ADRPT), 1
#define RPT2                             BANKMASK(ADRPT), 2
#define RPT3                             BANKMASK(ADRPT), 3
#define RPT4                             BANKMASK(ADRPT), 4
#define RPT5                             BANKMASK(ADRPT), 5
#define RPT6                             BANKMASK(ADRPT), 6
#define RPT7                             BANKMASK(ADRPT), 7
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RSEN2                            BANKMASK(SSP2CON2), 1
#define RW1                              BANKMASK(SSP1STAT), 2
#define RW2                              BANKMASK(SSP2STAT), 2
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_W2                             BANKMASK(SSP2STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define R_nW2                            BANKMASK(SSP2STAT), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCANIE                           BANKMASK(PIE1), 2
#define SCANIF                           BANKMASK(PIR1), 2
#define SCANMD                           BANKMASK(PMD0), 2
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SEN2                             BANKMASK(SSP2CON2), 0
#define SETUP0                           BANKMASK(CRCCON0), 2
#define SETUP1                           BANKMASK(CRCCON0), 3
#define SFOR                             BANKMASK(OSCSTAT), 1
#define SGO                              BANKMASK(SCANCON0), 6
#define SHIFT0                           BANKMASK(CRCSHFTL), 0
#define SHIFT1                           BANKMASK(CRCSHFTL), 1
#define SHIFT10                          BANKMASK(CRCSHFTH), 2
#define SHIFT11                          BANKMASK(CRCSHFTH), 3
#define SHIFT12                          BANKMASK(CRCSHFTH), 4
#define SHIFT13                          BANKMASK(CRCSHFTH), 5
#define SHIFT14                          BANKMASK(CRCSHFTH), 6
#define SHIFT15                          BANKMASK(CRCSHFTH), 7
#define SHIFT16                          BANKMASK(CRCSHFTU), 0
#define SHIFT17                          BANKMASK(CRCSHFTU), 1
#define SHIFT18                          BANKMASK(CRCSHFTU), 2
#define SHIFT19                          BANKMASK(CRCSHFTU), 3
#define SHIFT2                           BANKMASK(CRCSHFTL), 2
#define SHIFT20                          BANKMASK(CRCSHFTU), 4
#define SHIFT21                          BANKMASK(CRCSHFTU), 5
#define SHIFT22                          BANKMASK(CRCSHFTU), 6
#define SHIFT23                          BANKMASK(CRCSHFTU), 7
#define SHIFT24                          BANKMASK(CRCSHFTT), 0
#define SHIFT25                          BANKMASK(CRCSHFTT), 1
#define SHIFT26                          BANKMASK(CRCSHFTT), 2
#define SHIFT27                          BANKMASK(CRCSHFTT), 3
#define SHIFT28                          BANKMASK(CRCSHFTT), 4
#define SHIFT29                          BANKMASK(CRCSHFTT), 5
#define SHIFT3                           BANKMASK(CRCSHFTL), 3
#define SHIFT30                          BANKMASK(CRCSHFTT), 6
#define SHIFT31                          BANKMASK(CRCSHFTT), 7
#define SHIFT4                           BANKMASK(CRCSHFTL), 4
#define SHIFT5                           BANKMASK(CRCSHFTL), 5
#define SHIFT6                           BANKMASK(CRCSHFTL), 6
#define SHIFT7                           BANKMASK(CRCSHFTL), 7
#define SHIFT8                           BANKMASK(CRCSHFTH), 0
#define SHIFT9                           BANKMASK(CRCSHFTH), 1
#define SHIFTM                           BANKMASK(CRCCON0), 1
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLCT0                            BANKMASK(CLCSELECT), 0
#define SLCT1                            BANKMASK(CLCSELECT), 1
#define SLCT2                            BANKMASK(CLCSELECT), 2
#define SLCT3                            BANKMASK(CLCSELECT), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMP2                             BANKMASK(SSP2STAT), 7
#define SOC0                             BANKMASK(OPA1CON0), 0
#define SOC1                             BANKMASK(OPA1CON0), 1
#define SOI                              BANKMASK(ADCON3), 3
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1CLKPPS5                      BANKMASK(SSP1CLKPPS), 5
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1DATPPS5                      BANKMASK(SSP1DATPPS), 5
#define SSP1IE                           BANKMASK(PIE5), 2
#define SSP1IF                           BANKMASK(PIR5), 2
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP1SSPPS5                       BANKMASK(SSP1SSPPS), 5
#define SSP2IE                           BANKMASK(PIE5), 4
#define SSP2IF                           BANKMASK(PIR5), 4
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPEN2                           BANKMASK(SSP2CON1), 5
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM02                           BANKMASK(SSP2CON1), 0
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM12                           BANKMASK(SSP2CON1), 1
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM22                           BANKMASK(SSP2CON1), 2
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPM32                           BANKMASK(SSP2CON1), 3
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define SSPOV2                           BANKMASK(SSP2CON1), 6
#define START1                           BANKMASK(SSP1STAT), 3
#define START2                           BANKMASK(SSP2STAT), 3
#define STAT0                            BANKMASK(ADSTAT), 0
#define STAT1                            BANKMASK(ADSTAT), 1
#define STAT2                            BANKMASK(ADSTAT), 2
#define STATE                            BANKMASK(WDTTMR), 2
#define STATUS_SHAD0                     BANKMASK(STATUS_SHAD), 0
#define STATUS_SHAD1                     BANKMASK(STATUS_SHAD), 1
#define STATUS_SHAD2                     BANKMASK(STATUS_SHAD), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKPTR0                          BANKMASK(STKPTR), 0
#define STKPTR1                          BANKMASK(STKPTR), 1
#define STKPTR2                          BANKMASK(STKPTR), 2
#define STKPTR3                          BANKMASK(STKPTR), 3
#define STKPTR4                          BANKMASK(STKPTR), 4
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STOP2                            BANKMASK(SSP2STAT), 4
#define STPT0                            BANKMASK(ADSTPTL), 0
#define STPT1                            BANKMASK(ADSTPTL), 1
#define STPT10                           BANKMASK(ADSTPTH), 2
#define STPT11                           BANKMASK(ADSTPTH), 3
#define STPT12                           BANKMASK(ADSTPTH), 4
#define STPT13                           BANKMASK(ADSTPTH), 5
#define STPT15                           BANKMASK(ADSTPTH), 6
#define STPT16                           BANKMASK(ADSTPTH), 7
#define STPT2                            BANKMASK(ADSTPTL), 2
#define STPT3                            BANKMASK(ADSTPTL), 3
#define STPT4                            BANKMASK(ADSTPTL), 4
#define STPT5                            BANKMASK(ADSTPTL), 5
#define STPT6                            BANKMASK(ADSTPTL), 6
#define STPT7                            BANKMASK(ADSTPTL), 7
#define STPT8                            BANKMASK(ADSTPTH), 0
#define STPT9                            BANKMASK(ADSTPTH), 1
#define STRA                             BANKMASK(CWG1STR), 0
#define STRB                             BANKMASK(CWG1STR), 1
#define STRC                             BANKMASK(CWG1STR), 2
#define STRD                             BANKMASK(CWG1STR), 3
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 3
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CKIPPS5                        BANKMASK(T0CKIPPS), 5
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0MD16                           BANKMASK(T0CON0), 4
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0PR0                            BANKMASK(TMR0H), 0
#define T0PR1                            BANKMASK(TMR0H), 1
#define T0PR2                            BANKMASK(TMR0H), 2
#define T0PR3                            BANKMASK(TMR0H), 3
#define T0PR4                            BANKMASK(TMR0H), 4
#define T0PR5                            BANKMASK(TMR0H), 5
#define T0PR6                            BANKMASK(TMR0H), 6
#define T0PR7                            BANKMASK(TMR0H), 7
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CLK), 0
#define T1CS1                            BANKMASK(T1CLK), 1
#define T1CS2                            BANKMASK(T1CLK), 2
#define T1CS3                            BANKMASK(T1CLK), 3
#define T1CS4                            BANKMASK(T1CLK), 4
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GPPS5                          BANKMASK(T1GPPS), 5
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GATE), 0
#define T1GSS1                           BANKMASK(T1GATE), 1
#define T1GSS2                           BANKMASK(T1GATE), 2
